## Pivot Table
Rows contain a variable of interest, Columns another variable, and the cells an aggregate value. In my instance,particularly of use in time-values

Pivot tables often include marginal values as well, for example sums for each column or row

The value of pivot tables is that they provide a way to see the relationship between two variables at once

In [11]:
import pandas as pd
import numpy as np

df = pd.read_csv('../resources/week-3/datasets/cwurData.csv')
df

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [17]:
# create a new column called Rank_Level and categorize 1-100 (first-tier), 101-200 (second tier), 201-300 (third tier) and >300 other

def tiers(c):
    if c['world_rank'] <= 100:
        return 'First_tier'
    if c['world_rank'] >100 and c['world_rank'] <= 200:
        return 'Second_tier'
    if c['world_rank'] >200 and c['world_rank'] <= 300:
        return 'Third_tier'
    return 'Other' 

df['Rank_level'] = df.apply(tiers, axis=1)
df

# note that this could also have been set up tiers as a lambda function on the column 'world_rank

def assign_category(ranking):
    if ranking <= 100:
        return 'First_tier'
    if ranking >100 and ranking <= 200:
        return 'Second_tier'
    if ranking >200 and ranking <= 300:
        return 'Third_tier'
    return 'Other' 

df['Rank_level'] = df['world_rank'].apply(lambda x: assign_category(x))
df

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank_level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,First_tier
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,First_tier
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,First_tier
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,First_tier
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,First_tier
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015,Other
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015,Other
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015,Other
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015,Other
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015,Other

In [20]:
# creating the pivot table need to specify 3 things and an aggregation function
df.pivot_table(values = 'score', index = 'country', columns = 'Rank_level', aggfunc = [np.mean]).head()

                 mean
Rank_level First_tier      Other Second_tier Third_tier
country
Argentina         NaN  44.672857         NaN        NaN
Australia     47.9425  44.645750     49.2425  47.285000
Austria           NaN  44.864286         NaN  47.066667
Belgium       51.8750  45.081000     49.0840  46.746667
Brazil            NaN  44.499706     49.5650        NaN

In [22]:
# you can include more than one agfunc
df.pivot_table(values = 'score', index = 'country', columns = 'Rank_level', aggfunc = [np.mean, np.max]).head()

                 mean                                         amax         \
Rank_level First_tier      Other Second_tier Third_tier First_tier  Other
country
Argentina         NaN  44.672857         NaN        NaN        NaN  45.66
Australia     47.9425  44.645750     49.2425  47.285000      51.61  45.97
Austria           NaN  44.864286         NaN  47.066667        NaN  46.29
Belgium       51.8750  45.081000     49.0840  46.746667      52.03  46.21
Brazil            NaN  44.499706     49.5650        NaN        NaN  46.08


Rank_level Second_tier Third_tier
country
Argentina          NaN        NaN
Australia        50.40      47.47
Austria            NaN      47.78
Belgium          49.73      47.14
Brazil           49.82        NaN

In [23]:
# set margins=true in order to get marginal stats by row and column
df.pivot_table(values = 'score', index = 'country', columns = 'Rank_level', aggfunc = [np.mean, np.max],
               margins=True).head()

                 mean                                                    amax  \
Rank_level First_tier      Other Second_tier Third_tier        All First_tier
country
Argentina         NaN  44.672857         NaN        NaN  44.672857        NaN
Australia     47.9425  44.645750     49.2425  47.285000  45.825517      51.61
Austria           NaN  44.864286         NaN  47.066667  45.139583        NaN
Belgium       51.8750  45.081000     49.0840  46.746667  47.011000      52.03
Brazil            NaN  44.499706     49.5650        NaN  44.781111        NaN


Rank_level  Other Second_tier Third_tier    All
country
Argentina   45.66         NaN        NaN  45.66
Australia   45.97       50.40      47.47  51.61
Austria     46.29         NaN      47.78  47.78
Belgium     46.21       49.73      47.14  52.03
Brazil      46.08       49.82        NaN  49.82

### Using the derived data frame
the pivot table is itself a data frame, and can be manipulated using standard methods

In [29]:
df_new = df.pivot_table(values = 'score', index = 'country', columns = 'Rank_level', 
                        aggfunc = [np.mean, np.max],
                        margins=True)
df_new.head()
print (df_new.index)
print (df_new.columns)

Index(['Argentina', 'Australia', 'Austria', 'Belgium', 'Brazil', 'Bulgaria',
       'Canada', 'Chile', 'China', 'Colombia', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Egypt', 'Estonia', 'Finland', 'France',
       'Germany', 'Greece', 'Hong Kong', 'Hungary', 'Iceland', 'India', 'Iran',
       'Ireland', 'Israel', 'Italy', 'Japan', 'Lebanon', 'Lithuania',
       'Malaysia', 'Mexico', 'Netherlands', 'New Zealand', 'Norway', 'Poland',
       'Portugal', 'Puerto Rico', 'Romania', 'Russia', 'Saudi Arabia',
       'Serbia', 'Singapore', 'Slovak Republic', 'Slovenia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand',
       'Turkey', 'USA', 'Uganda', 'United Arab Emirates', 'United Kingdom',
       'Uruguay', 'All'],
      dtype='object', name='country')
MultiIndex([('mean',  'First_tier'),
            ('mean',       'Other'),
            ('mean', 'Second_tier'),
            ('mean',  'Third_tier'),
            ('mean',         'All'),
            ('amax',  'First_tier'),
            ('amax',       'Other'),
            ('amax', 'Second_tier'),
            ('amax',  'Third_tier'),
            ('amax',         'All')],
           names=[None, 'Rank_level'])

In [32]:
df_new['mean']['First_tier'].head()
#this produces a pandas series (two column table with first column being the index)

country
Argentina        NaN
Australia    47.9425
Austria          NaN
Belgium      51.8750
Brazil           NaN
Name: First_tier, dtype: float64

In [33]:
#you can get the max value using the built-in pandas series function idxmax
df_new['mean']['First_tier'].idxmax()

'United Kingdom'

### Stacking and unstacking
You can reshape your pivot table using the stack and unstack methods
Stacking is pivoting the lowermost column index to become the innermost row index. Unstacking it the reverse (innermost row index becomes the lowermost column index).

In [34]:
df_new.head()

                 mean                                                    amax  \
Rank_level First_tier      Other Second_tier Third_tier        All First_tier
country
Argentina         NaN  44.672857         NaN        NaN  44.672857        NaN
Australia     47.9425  44.645750     49.2425  47.285000  45.825517      51.61
Austria           NaN  44.864286         NaN  47.066667  45.139583        NaN
Belgium       51.8750  45.081000     49.0840  46.746667  47.011000      52.03
Brazil            NaN  44.499706     49.5650        NaN  44.781111        NaN


Rank_level  Other Second_tier Third_tier    All
country
Argentina   45.66         NaN        NaN  45.66
Australia   45.97       50.40      47.47  51.61
Austria     46.29         NaN      47.78  47.78
Belgium     46.21       49.73      47.14  52.03
Brazil      46.08       49.82        NaN  49.82

In [35]:
df_new.stack()

                            mean    amax
country   Rank_level
Argentina Other        44.672857   45.66
          All          44.672857   45.66
Australia First_tier   47.942500   51.61
          Other        44.645750   45.97
          Second_tier  49.242500   50.40
...                          ...     ...
All       First_tier   58.350675  100.00
          Other        44.738871   46.34
          Second_tier  49.065450   51.29
          Third_tier   46.843450   47.93
          All          47.798395  100.00

[193 rows x 2 columns]